holiday/app/controllers/holidays_controller.rb

  def index
@holiday = Holiday.all
respond_to do |format|
format.html # Send the page using HTML
format.xml { render :xml => @holidays } # Send the page using XML
format.atom
@holidays = Holiday.paginate :page => params[:page], :per_page => '12', :order => 'created_at DESC'
---
SELECT id FROM "holidays" ORDER BY id DESC
SELECT * FROM "holidays" ORDER BY dateleaving ASC LIMIT 12 OFFSET 72
SELECT count(*) AS count_all FROM "holidays"

  def show
login_required
@holiday = Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)

  def edit
    login_required
  @holiday= Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)

  def update
  	@holiday = Holiday.find(params[:id])
if@holiday.save
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)
UPDATE "holidays" SET "updated_at" = '2012-03-15 14:43:18', "photo_file_name" = 'fingerprint.jpg', "photo_file_size" = 58567, "photo_updated_at" = '2012-03-15 14:43:18', "photo_content_type" = 'image/jpeg' WHERE "id" = 79

  def create
    @holiday = Holiday.create(params[:holiday])
    @holiday.user_id = current_user.id
if@holiday.save
---
INSERT INTO "holidays" ("created_at", "photo_file_size", "comments", "updated_at", "photo_file_name", "photo_content_type", "approved", "declined", "datereturning", "user_id", "photo_updated_at", "dateleaving") VALUES('2012-03-15 14:15:40', NULL, NULL, '2012-03-15 14:15:40', NULL, NULL, NULL, NULL, '2012-09-26', NULL, NULL, '2011-10-10')
UPDATE "holidays" SET "updated_at" = '2012-04-05 14:03:20', "photo_updated_at" = '2012-04-05 14:03:19' WHERE "id" = 73

def destroy
  @holiday = Holiday.find(params[:id])
  @holiday.destroy
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 2)
DELETE FROM "holidays" WHERE "id" = 2