holiday/app/controllers/posts_controller.rb

  def index
    @posts = Post.all(:order => "created_at DESC")
---
SELECT * FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.create(:message => params[:post])
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "user_id", "message") VALUES('2012-04-08 13:17:25', '2012-04-08 13:17:25', NULL, '--- !map:HashWithIndifferentAccess
UPDATE "posts" SET "updated_at" = '2012-03-21 19:41:37', "user_id" = 46 WHERE "id" = 8